har-in-air/ESP32_IMU_BARO_GPS_VARIO/src/sensor/bmp3_defs.h
/**\name FIFO related macros */
/**\name FIFO enable  */
#define BMP3_ENABLE                             UINT8_C(0x01)
#define BMP3_DISABLE                            UINT8_C(0x00)

/**\name Interrupt pin configuration macros */
/**\name Open drain */
#define BMP3_INT_PIN_OPEN_DRAIN                 UINT8_C(0x01)
#define BMP3_INT_PIN_PUSH_PULL                  UINT8_C(0x00)

/**\name Level */
#define BMP3_INT_PIN_ACTIVE_HIGH                UINT8_C(0x01)
#define BMP3_INT_PIN_ACTIVE_LOW                 UINT8_C(0x00)

/**\name Latch */
#define BMP3_INT_PIN_LATCH                      UINT8_C(0x01)
#define BMP3_INT_PIN_NON_LATCH                  UINT8_C(0x00)

/**\name Advance settings  */
/**\name I2c watch dog timer period selection */
#define BMP3_I2C_WDT_SHORT_1_25_MS              UINT8_C(0x00)
#define BMP3_I2C_WDT_LONG_40_MS                 UINT8_C(0x01)

/**\name FIFO Sub-sampling macros */
#define BMP3_FIFO_NO_SUBSAMPLING                UINT8_C(0x00)
#define BMP3_FIFO_SUBSAMPLING_2X                UINT8_C(0x01)
#define BMP3_FIFO_SUBSAMPLING_4X                UINT8_C(0x02)
#define BMP3_FIFO_SUBSAMPLING_8X                UINT8_C(0x03)
#define BMP3_FIFO_SUBSAMPLING_16X               UINT8_C(0x04)
#define BMP3_FIFO_SUBSAMPLING_32X               UINT8_C(0x05)
#define BMP3_FIFO_SUBSAMPLING_64X               UINT8_C(0x06)
#define BMP3_FIFO_SUBSAMPLING_128X              UINT8_C(0x07)

/**\name Over sampling macros */
#define BMP3_NO_OVERSAMPLING                    UINT8_C(0x00)
#define BMP3_OVERSAMPLING_2X                    UINT8_C(0x01)
#define BMP3_OVERSAMPLING_4X                    UINT8_C(0x02)
#define BMP3_OVERSAMPLING_8X                    UINT8_C(0x03)
#define BMP3_OVERSAMPLING_16X                   UINT8_C(0x04)
#define BMP3_OVERSAMPLING_32X                   UINT8_C(0x05)

/**\name Filter setting macros */
#define BMP3_IIR_FILTER_DISABLE                 UINT8_C(0x00)
#define BMP3_IIR_FILTER_COEFF_1                 UINT8_C(0x01)
#define BMP3_IIR_FILTER_COEFF_3                 UINT8_C(0x02)
#define BMP3_IIR_FILTER_COEFF_7                 UINT8_C(0x03)
#define BMP3_IIR_FILTER_COEFF_15                UINT8_C(0x04)
#define BMP3_IIR_FILTER_COEFF_31                UINT8_C(0x05)
#define BMP3_IIR_FILTER_COEFF_63                UINT8_C(0x06)
#define BMP3_IIR_FILTER_COEFF_127               UINT8_C(0x07)

/**\name Odr setting macros */
#define BMP3_ODR_200_HZ                         UINT8_C(0x00)
#define BMP3_ODR_100_HZ                         UINT8_C(0x01)
#define BMP3_ODR_50_HZ                          UINT8_C(0x02)
#define BMP3_ODR_25_HZ                          UINT8_C(0x03)
#define BMP3_ODR_12_5_HZ                        UINT8_C(0x04)
#define BMP3_ODR_6_25_HZ                        UINT8_C(0x05)
#define BMP3_ODR_3_1_HZ                         UINT8_C(0x06)
#define BMP3_ODR_1_5_HZ                         UINT8_C(0x07)
#define BMP3_ODR_0_78_HZ                        UINT8_C(0x08)
#define BMP3_ODR_0_39_HZ                        UINT8_C(0x09)
#define BMP3_ODR_0_2_HZ                         UINT8_C(0x0A)
#define BMP3_ODR_0_1_HZ                         UINT8_C(0x0B)
#define BMP3_ODR_0_05_HZ                        UINT8_C(0x0C)
#define BMP3_ODR_0_02_HZ                        UINT8_C(0x0D)
#define BMP3_ODR_0_01_HZ                        UINT8_C(0x0E)
#define BMP3_ODR_0_006_HZ                       UINT8_C(0x0F)
#define BMP3_ODR_0_003_HZ                       UINT8_C(0x10)
#define BMP3_ODR_0_001_HZ                       UINT8_C(0x11)

/**\name Soft reset command */
#define BMP3_SOFT_RESET                         UINT8_C(0xB6)

/**\name FIFO flush command */
#define BMP3_FIFO_FLUSH                         UINT8_C(0xB0)

/**\name API success code */
#define BMP3_OK                                 INT8_C(0)

/**\name API error codes */
#define BMP3_E_NULL_PTR                         INT8_C(-1)
#define BMP3_E_COMM_FAIL                        INT8_C(-2)
#define BMP3_E_INVALID_ODR_OSR_SETTINGS         INT8_C(-3)
#define BMP3_E_CMD_EXEC_FAILED                  INT8_C(-4)
#define BMP3_E_CONFIGURATION_ERR                INT8_C(-5)
#define BMP3_E_INVALID_LEN                      INT8_C(-6)
#define BMP3_E_DEV_NOT_FOUND                    INT8_C(-7)
#define BMP3_E_FIFO_WATERMARK_NOT_REACHED       INT8_C(-8)

/**\name API warning codes */
#define BMP3_W_SENSOR_NOT_ENABLED               INT8_C(1)
#define BMP3_W_INVALID_FIFO_REQ_FRAME_CNT       INT8_C(2)
#define BMP3_W_MIN_TEMP                         INT8_C(3)
#define BMP3_W_MAX_TEMP                         INT8_C(4)
#define BMP3_W_MIN_PRES                         INT8_C(5)
#define BMP3_W_MAX_PRES                         INT8_C(6)

/**\name Macros to select the which sensor settings are to be set by the user.
 * These values are internal for API implementation. Don't relate this to
 * data sheet. */
#define BMP3_SEL_PRESS_EN                       UINT16_C(1 << 1)
#define BMP3_SEL_TEMP_EN                        UINT16_C(1 << 2)
#define BMP3_SEL_DRDY_EN                        UINT16_C(1 << 3)
#define BMP3_SEL_PRESS_OS                       UINT16_C(1 << 4)
#define BMP3_SEL_TEMP_OS                        UINT16_C(1 << 5)
#define BMP3_SEL_IIR_FILTER                     UINT16_C(1 << 6)
#define BMP3_SEL_ODR                            UINT16_C(1 << 7)
#define BMP3_SEL_OUTPUT_MODE                    UINT16_C(1 << 8)
#define BMP3_SEL_LEVEL                          UINT16_C(1 << 9)
#define BMP3_SEL_LATCH                          UINT16_C(1 << 10)
#define BMP3_SEL_I2C_WDT_EN                     UINT16_C(1 << 11)
#define BMP3_SEL_I2C_WDT                        UINT16_C(1 << 12)
#define BMP3_SEL_ALL                            UINT16_C(0x7FF)

/**\name Macros to select the which FIFO settings are to be set by the user
 * These values are internal for API implementation. Don't relate this to
 * data sheet.*/
#define BMP3_SEL_FIFO_MODE                      UINT16_C(1 << 1)
#define BMP3_SEL_FIFO_STOP_ON_FULL_EN           UINT16_C(1 << 2)
#define BMP3_SEL_FIFO_TIME_EN                   UINT16_C(1 << 3)
#define BMP3_SEL_FIFO_PRESS_EN                  UINT16_C(1 << 4)
#define BMP3_SEL_FIFO_TEMP_EN                   UINT16_C(1 << 5)
#define BMP3_SEL_FIFO_DOWN_SAMPLING             UINT16_C(1 << 6)
#define BMP3_SEL_FIFO_FILTER_EN                 UINT16_C(1 << 7)
#define BMP3_SEL_FIFO_FWTM_EN                   UINT16_C(1 << 8)
#define BMP3_SEL_FIFO_FULL_EN                   UINT16_C(1 << 9)

/**\name Sensor component selection macros
 * These values are internal for API implementation. Don't relate this to
 * data sheet.*/
#define BMP3_PRESS                              UINT8_C(1)
#define BMP3_TEMP                               UINT8_C(2)
#define BMP3_PRESS_TEMP                         UINT8_C(3)

/**\name Temperature range values in integer and float */
#define BMP3_MIN_TEMP_INT                       INT64_C(-4000)
#define BMP3_MAX_TEMP_INT                       INT64_C(8500)
#define BMP3_MIN_TEMP_FLOAT                    -40.0f
#define BMP3_MAX_TEMP_FLOAT                    85.0f

/**\name Pressure range values in integer and float */
#define BMP3_MIN_PRES_INT                       UINT64_C(3000000)
#define BMP3_MAX_PRES_INT                       UINT64_C(12500000)
#define BMP3_MIN_PRES_FLOAT                    30000.0f
#define BMP3_MAX_PRES_FLOAT                    125000.0f

/**\name Macros for bit masking */
#define BMP3_ERR_FATAL_MSK                      UINT8_C(0x01)

#define BMP3_ERR_CMD_MSK                        UINT8_C(0x02)
#define BMP3_ERR_CMD_POS                        UINT8_C(0x01)

#define BMP3_ERR_CONF_MSK                       UINT8_C(0x04)
#define BMP3_ERR_CONF_POS                       UINT8_C(0x02)

