har-in-air/ESP32_IMU_BARO_GPS_VARIO/src/sensor/bmp3_defs.h
#define BMP3_STATUS_CMD_RDY_MSK                 UINT8_C(0x10)
#define BMP3_STATUS_CMD_RDY_POS                 UINT8_C(0x04)

#define BMP3_STATUS_DRDY_PRESS_MSK              UINT8_C(0x20)
#define BMP3_STATUS_DRDY_PRESS_POS              UINT8_C(0x05)

#define BMP3_STATUS_DRDY_TEMP_MSK               UINT8_C(0x40)
#define BMP3_STATUS_DRDY_TEMP_POS               UINT8_C(0x06)

#define BMP3_OP_MODE_MSK                        UINT8_C(0x30)
#define BMP3_OP_MODE_POS                        UINT8_C(0x04)

#define BMP3_PRESS_EN_MSK                       UINT8_C(0x01)

#define BMP3_TEMP_EN_MSK                        UINT8_C(0x02)
#define BMP3_TEMP_EN_POS                        UINT8_C(0x01)

#define BMP3_IIR_FILTER_MSK                     UINT8_C(0x0E)
#define BMP3_IIR_FILTER_POS                     UINT8_C(0x01)

#define BMP3_ODR_MSK                            UINT8_C(0x1F)

#define BMP3_PRESS_OS_MSK                       UINT8_C(0x07)

#define BMP3_TEMP_OS_MSK                        UINT8_C(0x38)
#define BMP3_TEMP_OS_POS                        UINT8_C(0x03)

#define BMP3_FIFO_MODE_MSK                      UINT8_C(0x01)

#define BMP3_FIFO_STOP_ON_FULL_MSK              UINT8_C(0x02)
#define BMP3_FIFO_STOP_ON_FULL_POS              UINT8_C(0x01)

#define BMP3_FIFO_TIME_EN_MSK                   UINT8_C(0x04)
#define BMP3_FIFO_TIME_EN_POS                   UINT8_C(0x02)

#define BMP3_FIFO_PRESS_EN_MSK                  UINT8_C(0x08)
#define BMP3_FIFO_PRESS_EN_POS                  UINT8_C(0x03)

#define BMP3_FIFO_TEMP_EN_MSK                   UINT8_C(0x10)
#define BMP3_FIFO_TEMP_EN_POS                   UINT8_C(0x04)

#define BMP3_FIFO_FILTER_EN_MSK                 UINT8_C(0x18)
#define BMP3_FIFO_FILTER_EN_POS                 UINT8_C(0x03)

#define BMP3_FIFO_DOWN_SAMPLING_MSK             UINT8_C(0x07)

#define BMP3_FIFO_FWTM_EN_MSK                   UINT8_C(0x08)
#define BMP3_FIFO_FWTM_EN_POS                   UINT8_C(0x03)

#define BMP3_FIFO_FULL_EN_MSK                   UINT8_C(0x10)
#define BMP3_FIFO_FULL_EN_POS                   UINT8_C(0x04)

#define BMP3_INT_OUTPUT_MODE_MSK                UINT8_C(0x01)

#define BMP3_INT_LEVEL_MSK                      UINT8_C(0x02)
#define BMP3_INT_LEVEL_POS                      UINT8_C(0x01)

#define BMP3_INT_LATCH_MSK                      UINT8_C(0x04)
#define BMP3_INT_LATCH_POS                      UINT8_C(0x02)

#define BMP3_INT_DRDY_EN_MSK                    UINT8_C(0x40)
#define BMP3_INT_DRDY_EN_POS                    UINT8_C(0x06)

#define BMP3_I2C_WDT_EN_MSK                     UINT8_C(0x02)
#define BMP3_I2C_WDT_EN_POS                     UINT8_C(0x01)

#define BMP3_I2C_WDT_SEL_MSK                    UINT8_C(0x04)
#define BMP3_I2C_WDT_SEL_POS                    UINT8_C(0x02)

#define BMP3_INT_STATUS_FWTM_MSK                UINT8_C(0x01)

#define BMP3_INT_STATUS_FFULL_MSK               UINT8_C(0x02)
#define BMP3_INT_STATUS_FFULL_POS               UINT8_C(0x01)

#define BMP3_INT_STATUS_DRDY_MSK                UINT8_C(0x08)
#define BMP3_INT_STATUS_DRDY_POS                UINT8_C(0x03)

/**\name    UTILITY MACROS  */
#define BMP3_SET_LOW_BYTE                       UINT16_C(0x00FF)
#define BMP3_SET_HIGH_BYTE                      UINT16_C(0xFF00)

/**\name Macro to combine two 8 bit data's to form a 16 bit data */
#define BMP3_CONCAT_BYTES(msb, lsb)             (((uint16_t)msb << 8) | (uint16_t)lsb)

#define BMP3_SET_BITS(reg_data, bitname, data) \
    ((reg_data & ~(bitname##_MSK)) | \
     ((data << bitname##_POS) & bitname##_MSK))

/* Macro variant to handle the bitname position if it is zero */
#define BMP3_SET_BITS_POS_0(reg_data, bitname, data) \
    ((reg_data & ~(bitname##_MSK)) | \
     (data & bitname##_MSK))

#define BMP3_GET_BITS(reg_data, bitname)        ((reg_data & (bitname##_MSK)) >> \
                                                 (bitname##_POS))

/* Macro variant to handle the bitname position if it is zero */
#define BMP3_GET_BITS_POS_0(reg_data, bitname)  (reg_data & (bitname##_MSK))

#define BMP3_GET_LSB(var)                       (uint8_t)(var & BMP3_SET_LOW_BYTE)
#define BMP3_GET_MSB(var)                       (uint8_t)((var & BMP3_SET_HIGH_BYTE) >> 8)

/**\name Macros related to size */
#define BMP3_LEN_CALIB_DATA                     UINT8_C(21)
#define BMP3_LEN_P_AND_T_HEADER_DATA            UINT8_C(7)
#define BMP3_LEN_P_OR_T_HEADER_DATA             UINT8_C(4)
#define BMP3_LEN_P_T_DATA                       UINT8_C(6)
#define BMP3_LEN_GEN_SETT                       UINT8_C(7)
#define BMP3_LEN_P_DATA                         UINT8_C(3)
#define BMP3_LEN_T_DATA                         UINT8_C(3)
#define BMP3_LEN_SENSOR_TIME                    UINT8_C(3)
#define BMP3_FIFO_MAX_FRAMES                    UINT8_C(73)

/*! Power control settings */
#define BMP3_POWER_CNTL                         UINT16_C(0x0006)

/*! Odr and filter settings */
#define BMP3_ODR_FILTER                         UINT16_C(0x00F0)

/*! Interrupt control settings */
#define BMP3_INT_CTRL                           UINT16_C(0x0708)

/*! Advance settings */
#define BMP3_ADV_SETT                           UINT16_C(0x1800)

/*! FIFO settings */

/*! Mask for fifo_mode, fifo_stop_on_full, fifo_time_en, fifo_press_en and
 * fifo_temp_en settings */
#define BMP3_FIFO_CONFIG_1                      UINT16_C(0x003E)

/*! Mask for fifo_sub_sampling and data_select settings */
#define BMP3_FIFO_CONFIG_2                      UINT16_C(0x00C0)

/*! Mask for fwtm_en and ffull_en settings */
#define BMP3_FIFO_INT_CTRL                      UINT16_C(0x0300)

/*! FIFO Header */
/*! FIFO temperature pressure header frame */
#define BMP3_FIFO_TEMP_PRESS_FRAME              UINT8_C(0x94)

/*! FIFO temperature header frame */
#define BMP3_FIFO_TEMP_FRAME                    UINT8_C(0x90)

/*! FIFO pressure header frame */
#define BMP3_FIFO_PRESS_FRAME                   UINT8_C(0x84)

/*! FIFO time header frame */
#define BMP3_FIFO_TIME_FRAME                    UINT8_C(0xA0)

/*! FIFO error header frame */
#define BMP3_FIFO_ERROR_FRAME                   UINT8_C(0x44)

/*! FIFO configuration change header frame */
#define BMP3_FIFO_CONFIG_CHANGE                 UINT8_C(0x48)

/*! FIFO empty frame */
#define BMP3_FIFO_EMPTY_FRAME                   UINT8_C(0x80)

